{"items":[{"id":0,"author":"Waseem Latif","quote":"Think twice, code once."},{"id":1,"author":"Steve Jobs","quote":"Stay Hungry. Stay Foolish."},{"id":2,"author":"Jeff Sickel","quote":"Deleted code is debugged code."},{"id":3,"author":"Merb motto","quote":"No code is faster than no code."},{"id":4,"author":"Plato","quote":"Necessity is the mother of invention."},{"id":5,"author":"Sercan Leylek","quote":"Every programmer is an author."},{"id":6,"author":"Albert Einstein","quote":"Information is not knowledge."},{"id":7,"author":"Linus Torvalds","quote":"Talk is cheap. Show me the code."},{"id":8,"author":"Jim Goodwin","quote":"The impossible is often the untried."},{"id":9,"author":"Toba Beta","quote":"AI is the transformer of civilization."},{"id":10,"author":"Brian Kernighan","quote":"Don't comment bad code - rewrite it."},{"id":11,"author":"Jed McKenna","quote":"Enlightenment is the unprogrammed state."},{"id":12,"author":"Ron Jeffries","quote":"Code never lies, comments sometimes do."},{"id":13,"author":"Imtiaz Iqbal","quote":"Life doesn't have a ctrl-z. Type wisely."},{"id":14,"author":"Meredith Belbin","quote":"Nobody is perfect, but a team can be."},{"id":15,"author":"Bill Gates","quote":"The Internet?  We are not interested in it."},{"id":16,"author":"Waseem Latif","quote":"Programming is usually taught by examples."},{"id":17,"author":"Robert C. Martin","quote":"The only way to go fast, is to go well."},{"id":18,"author":"Steve McConnell","quote":"Good code is its own best documentation."},{"id":19,"author":"Atli Björgvin Oddsson","quote":"Don’t document the problem, fix it."},{"id":20,"author":"David Ferrell","quote":"Sometimes you cannot program around stupid."},{"id":21,"author":"Mokokoma Mokhonoana","quote":"Most improved things can be improved."},{"id":22,"author":"Samuel Beckett","quote":"I try. I fail. I try again. I fail better."},{"id":23,"author":"Ahmad Moawad","quote":"Why bother with null and java 8 has optional."},{"id":24,"author":"Isaac Asimov","quote":"I do not fear computers. I fear lack of them."},{"id":25,"author":"John Johnson","quote":"First, solve the problem.Then write the code."},{"id":26,"author":"Albert Einstein","quote":"The only source of knowledge is experience."},{"id":27,"author":"Steven R Garman","quote":"Physics is the universe’s operating system."},{"id":28,"author":"C.D. Jackson","quote":"Great ideas need landing gear as well as wings."},{"id":29,"author":"Donald Knuth","quote":"Premature optimization is the root of all evil."},{"id":30,"author":"Erik Meijer","quote":"Think like a fundamentalist, code like a hacker."},{"id":31,"author":"Jamie Zawinski","quote":"Linux is only free if your time has no value."},{"id":32,"author":"Leonardo da Vinci","quote":"Simplicity is the ultimate sophistication."},{"id":33,"author":"Unknown","quote":"Weeks of programming can save you hours of planning."},{"id":34,"author":"Voltaire","quote":"No snowflake in an avalanche ever feels responsible."},{"id":35,"author":"Ahkeno","quote":"We are writing our own ‪#‎karma‬! I mean my test cases."},{"id":36,"author":"Edsger W. Dijkstra","quote":"Simplicity is prerequisite for reliability."},{"id":37,"author":"Rod Michael","quote":"If you automate a mess, you get an automated mess."},{"id":38,"author":"Halgurd Hussein","quote":"I am committed to push my branch to the master."},{"id":39,"author":"Robert C. Martin","quote":"Truth can only be found in one place: the code."},{"id":40,"author":"Annalee Newitz","quote":"For all the robots who question their programming."},{"id":41,"author":"Karin Donker","quote":"There’s no time to stop for gas, we’re already late."},{"id":42,"author":"C. A. R. Hoare","quote":"The unavoidable price of reliability is simplicity."},{"id":43,"author":"Jon Franklin","quote":"Simplicity, carried to the extreme, becomes elegance."},{"id":44,"author":"W. Edwards Deming","quote":"A bad system will beat a good person every time."},{"id":45,"author":"Alan Perlis","quote":"Simplicity does not precede complexity, but follows it."},{"id":46,"author":"Johann Wolfgang von Goethe","quote":"He who moves not forward, goes backward."},{"id":47,"author":"Donald Knuth","quote":"If you optimize everything, you will always be unhappy."},{"id":48,"author":"Jeff Polk","quote":"There’s no obfuscated Perl contest because it’s pointless."},{"id":49,"author":"Nathan Myhrvold","quote":"Software is a gas; it expands to fill its container."},{"id":50,"author":"Unknown","quote":"Invest a few moments in thinking. It will pay good interest."},{"id":51,"author":"John Carmack","quote":"Low-level programming is good for the programmer’s soul."},{"id":52,"author":"Michael Feathers","quote":"Programming is the art of doing one thing at a time."},{"id":53,"author":"Rasheed Ogunlaru","quote":"How you look at it is pretty much how you'll see it."},{"id":54,"author":"David Parnas","quote":"One bad programmer can easily create two new jobs a year."},{"id":55,"author":"Fred Brooks","quote":"Adding manpower to a late software project makes it later."},{"id":56,"author":"Unknown","quote":"Different isn't always better, but better is always different."},{"id":57,"author":"Albert Einstein","quote":"Make everything as simple as possible, but not simpler."},{"id":58,"author":"Edward Gibbon","quote":"All that is human must retrograde if it does not advance."},{"id":59,"author":"Jeff Pesis","quote":"Hardware: The parts of a computer system that can be kicked."},{"id":60,"author":"Robert S. Barton","quote":"System programmers are the high priests of a low cult."},{"id":61,"author":"Seymour Papert","quote":"BASIC is to computer programming as QWERTY is to typing."},{"id":62,"author":"Alex Lowe","quote":"Code generation, like drinking alcohol, is good in moderation."},{"id":63,"author":"Amit Kalantri","quote":"Software testing is a sport like hunting, it's bughunting."},{"id":64,"author":"Chris Wenham","quote":"Debugging time increases as a square of the program’s size."},{"id":65,"author":"Ralph Johnson","quote":"Before software can be reusable it first has to be usable."},{"id":66,"author":"Albert Einstein","quote":"A clever person solves a problem. A wise person AVOIDS it."},{"id":67,"author":"Alan Kay","quote":"Simple things should be simple, complex things should be possible."},{"id":68,"author":"Ken Thompson","quote":"You can’t trust code that you did not totally create yourself."},{"id":69,"author":"Linus Torvalds","quote":"If you think your users are idiots, only idiots will use it."},{"id":70,"author":"Bertrand Meyer","quote":"Incorrect documentation is often worse than no documentation."},{"id":71,"author":"Bill Gates","quote":"Your most unhappy customers are your greatest source of learning."},{"id":72,"author":"Gavin Russell Baker","quote":"C++ : Where friends have access to your private members."},{"id":73,"author":"Larry Wall","quote":"I think it’s a new feature. Don’t tell anyone it was an accident."},{"id":74,"author":"Bill Gates","quote":"The computer was born to solve problems that did not exist before."},{"id":75,"author":"Brian Kernigan","quote":"Controlling complexity is the essence of computer programming."},{"id":76,"author":"Milt Bryce","quote":"There is only one problem with common sense; it’s not very common."},{"id":77,"author":"Thomas Jefferson","quote":"Great innovations should not be forced on slender majorities."},{"id":78,"author":"W. Edwards Deming","quote":"If you stay in this world, you will never learn another one."},{"id":79,"author":"W. Edwards Deming","quote":"It does not happen all at once. There is no instant pudding."},{"id":80,"author":"Waseem Latif","quote":"Programming is not easy like Sunday morning, it is silent poetry."},{"id":81,"author":"Carrie Latet","quote":"Nature does constant value stream mapping - it's called evolution."},{"id":82,"author":"David Heinemeier Hansson","quote":"The best way to predict the future is to implement it."},{"id":83,"author":"Ahmad Moawad","quote":"Write a program in efficient way as you write for kernel scheduler."},{"id":84,"author":"Alan Bennett","quote":"Standards are always out of date. That’s what makes them standards."},{"id":85,"author":"Thomas A. Edison","quote":"I have not failed. I've just found 10,000 ways that won't work."},{"id":86,"author":"Albert Einstein","quote":"Anyone who has never made a mistake has never tried anything new."},{"id":87,"author":"David Wheeler","quote":"Compatibility means deliberately repeating other people’s mistakes."},{"id":88,"author":"Ken Thompson","quote":"One of my most productive days was throwing away 1000 lines of code."},{"id":89,"author":"Suzy Kassem","quote":"A conscious human is driven by their conscience, not popular opinion."},{"id":90,"author":"W. Edwards Deming","quote":"Does experience help? NO! Not if we are doing the wrong things."},{"id":91,"author":"Alan Perlis","quote":"If you have a procedure with ten parameters, you probably missed some."},{"id":92,"author":"Edsger W. Dijkstra","quote":"Testing can only prove the presence of bugs, not their absence."},{"id":93,"author":"Yogi Berra","quote":"In theory, theory and practice are the same. In practice, they are not."},{"id":94,"author":"Dennis Ritchie","quote":"UNIX is simple. It just takes a genius to understand its simplicity."},{"id":95,"author":"Kent Beck","quote":"I'm not a great programmer; I'm just a good programmer with great habits."},{"id":96,"author":"Ritesh Shrivastav","quote":"Learning a language is not interesting than knowing how it works."},{"id":97,"author":"Albert Einstein","quote":"If you can't explain it simply, you don't understand it well enough."},{"id":98,"author":"Douglas Adams","quote":"I love deadlines. I like the whooshing sound they make as they fly by."},{"id":99,"author":"Jinvirle","quote":"Not all roots are buried down in the ground, some are at the top of a tree."},{"id":100,"author":"Norm Schryer","quote":"If the code and the comments do not match, possibly both are incorrect."},{"id":101,"author":"Unknown","quote":"Computer are like air conditioners: they stop working when you open windows."},{"id":102,"author":"W. Edwards Deming","quote":"You can not inspect quality into the product; it is already there."},{"id":103,"author":"Chris Pine","quote":"Programming isn't about what you know; it's about what you can figure out."},{"id":104,"author":"Mark Zuckerberg","quote":"People don't care about what you say, they care about what you build."},{"id":105,"author":"Theodore Levitt","quote":"Creativity is thinking up new things. Innovation is doing new things."},{"id":106,"author":"Jeff Atwood","quote":"We have to stop optimizing for programmers and start optimizing for users."},{"id":107,"author":"Unknown","quote":"There are so many men who can figure costs, and so few who can measure values."},{"id":108,"author":"Unknown","quote":"Why do we never have time to do it right, but always have time to DO IT OVER?."},{"id":109,"author":"Grady Booch","quote":"The function of a good software is to make the complex appear to be simple."},{"id":110,"author":"Kent Beck","quote":"Optimism is an occupational hazard of programming; feedback is the treatment."},{"id":111,"author":"Norman Vincent Peale","quote":"Shoot for the moon. Even if you miss, you'll land among the stars."},{"id":112,"author":"Robert C. Martin","quote":"Redundant comments are just places to collect lies and misinformation."},{"id":113,"author":"Roy Osherove","quote":"Tests are stories we tell the next generation of programmers on a project."},{"id":114,"author":"Shigeo Shingo","quote":"Improvement usually means doing something that we have never done before."},{"id":115,"author":"Unknown","quote":"Take care of the large problems and the small ones will tend not to bother you."},{"id":116,"author":"Alan Perlis","quote":"It is easier to change the specification to fit the program than vice versa."},{"id":117,"author":"Carlos Bueno","quote":"I once generalized from a single data point, and I'll never do that again!."},{"id":118,"author":"Donald Knuth","quote":"Computers are good at following instructions, but not at reading your mind."},{"id":119,"author":"Emo Philips","quote":"A computer once beat me at chess, but it was no match for me at kick boxing."},{"id":120,"author":"Steve Jobs","quote":"Design is not just what it looks like and feels like. Design is how it works."},{"id":121,"author":"Terry Baker","quote":"A program is never less than 90% complete, and never more than 95% complete."},{"id":122,"author":"Thomas A. Edison","quote":"Genius is one percent inspiration and ninety-nine percent perspiration."},{"id":123,"author":"Gil Zilberfeld","quote":"Bad programmers have all the answers. Good testers have all the questions."},{"id":124,"author":"Keith Bostic","quote":"Perl: The only language that looks the same before and after RSA encryption."},{"id":125,"author":"Ron Lisle","quote":"I’ve learned over the past few years that comments should be considered smells."},{"id":126,"author":"Steve Jobs","quote":"You've baked a really lovely cake, but then you've used dog shit for frosting."},{"id":127,"author":"Unknown","quote":"There are 10 people in the world, those who can read BINARY and those who cannot."},{"id":128,"author":"Vidiu Platon","quote":"I don’t care if it works on your machine! We are not shipping your machine!."},{"id":129,"author":"Franz Kafka","quote":"Productivity is being able to do things that you were never able to do before."},{"id":130,"author":"T.F. Hodge","quote":"The vision teller tells the vision to unguarded minds' of prey. The programmed."},{"id":131,"author":"Donald Knuth","quote":"Beware of bugs in the above code; I have only proved it correct, not tried it."},{"id":132,"author":"Oprah Winfrey","quote":"The essential question is not,  How busy are you?  but  What are you busy at?."},{"id":133,"author":"Benjamin H Bratton","quote":"Platforms don't look like how they work and don't work like how they look."},{"id":134,"author":"Frank Lloyd Wright","quote":"If it keeps up, man will atrophy all his limbs but the push-button finger."},{"id":135,"author":"Henry Ford","quote":"If we’d asked the customers what they wanted, they would have said  faster horses."},{"id":136,"author":"Richard Pattis","quote":"When debugging, novices insert corrective code; experts remove defective code."},{"id":137,"author":"Alan Kay","quote":"The most disastrous thing that you can ever learn is your first programming language."},{"id":138,"author":"Blaise Pascal","quote":"Small minds are concerned with the extraordinary, great minds with the ordinary."},{"id":139,"author":"Dr. Hazem Ali","quote":"The happiest moment i felt; is that moment when i realized my ability to create."},{"id":140,"author":"Felix Frankfurter","quote":"I don't like a man to be too efficient.  He's likely to be not human enough."},{"id":141,"author":"James Charlton","quote":"Don't waste time learning the  tricks of the trade.   Instead, learn the trade."},{"id":142,"author":"Steven Redhead","quote":"The programming of the consciousness is based upon what is accepted or believed."},{"id":143,"author":"Unknown","quote":"Amateurs work until they get it right. Professionals work until they can't get it wrong."},{"id":144,"author":"Albert Einstein","quote":"We cannot solve our problems with the same thinking we used when we created them."},{"id":145,"author":"Andrew Edward Lucier","quote":"Reality really relies on authoritatively regulating Your absolute attention."},{"id":146,"author":"Lawrence J. Peter","quote":"If you don't know where you are going, you will probably end up somewhere else."},{"id":147,"author":"Robert C. Martin","quote":"The perfect kind of architecture decision is the one which never has to be made."},{"id":148,"author":"Unknown","quote":"XML is like violence - if it doesn't solve your problems, you are not using enough of it."},{"id":149,"author":"Watts Humprey","quote":"Innovation is the process of turning ideas into manufacturable and marketable form."},{"id":150,"author":"Anthony J. D'Angelo","quote":"When solving problems, dig at the roots instead of just hacking at the leaves."},{"id":151,"author":"Craig Bruce","quote":"It’s hardware that makes a machine fast. It’s software that makes a fast machine slow."},{"id":152,"author":"Edsger W. Dijkstra","quote":"Computer Science is no more about computers than astronomy is about telescopes."},{"id":153,"author":"Richard P. Gabriel","quote":"Programmers are not mathematicians, no matter how much we wish and wish for it."},{"id":154,"author":"Scott Cherf","quote":"To go faster, slow down. Everybody who knows about orbital mechanics understands that."},{"id":155,"author":"William Laeder","quote":"Debugging becomes significantly easier if you first admit that you are the problem."},{"id":156,"author":"Edmond Mbiaka","quote":"Take positive care of your mind, and it would surely take positive care of your life."},{"id":157,"author":"Jazzwant","quote":"Programming is breaking of one big impossible task into several very small possible tasks."},{"id":158,"author":"Sidney Howard","quote":"One half of knowing what you want is knowing what you must give up before you get it."},{"id":159,"author":"Stephen Baxter, Ultima","quote":"A sentient mind refuses to be confined by the parameters of its programming."},{"id":160,"author":"Akshat Paul","quote":"User interface is the process of shifting from chaotic complexity to elegant simplicity."},{"id":161,"author":"Bertrand Meyer","quote":"There are only two things wrong with C++: The initial concept and the implementation."},{"id":162,"author":"IO Angell","quote":"Today, most software exists, not to solve a problem, but to interface with other software."},{"id":163,"author":"Linus Torvalds","quote":"I am not out to destroy Microsoft, that would be a completely unintended side effect."},{"id":164,"author":"Unknown","quote":"Without requirements or design, programming is the art of adding bugs to an empty text file."},{"id":165,"author":"W. Edwards Deming","quote":"It is not enough to do your best; you must know what to do, and then do your best."},{"id":166,"author":"Doug Linder","quote":"A good programmer is someone who always looks both ways before crossing a one-way street."},{"id":167,"author":"Gary Hopkins","quote":"Your limitations are largely programming instilled by others that you choose to believe."},{"id":168,"author":"Aldous Huxley","quote":"Experience is not what happens to a man; it is what a man does with what happens to him."},{"id":169,"author":"Alan J. Perlis","quote":"A language that doesn't affect the way you think about programming is not worth knowing."},{"id":170,"author":"James O. Coplien","quote":"You should name a variable using the same care with which you name a first-born child."},{"id":171,"author":"Peter F. Drucker","quote":"There is nothing so useless as doing efficiently that which should not be done at all."},{"id":172,"author":"Unknown","quote":"The city’s central computer told you?  R2D2, you know better than to trust a strange computer!."},{"id":173,"author":"Bill Curtis","quote":"In a room full of top software designers, if two agree on the same thing, that’s a majority."},{"id":174,"author":"Dr. Hazem Ali","quote":"Don't try to make something that someone has already did. Try to make something different."},{"id":175,"author":"Rasheed Ogunlaru","quote":"Our life stories are largely constructed and without mindfulness can prove destructive."},{"id":176,"author":"Robert Sewell","quote":"If Java had true garbage collection, most programs would delete themselves upon execution."},{"id":177,"author":"Robert C. Martin","quote":"Abstraction is the elimination of the irrelevant and the amplification of the essential."},{"id":178,"author":"Donald Knuth","quote":"Everyday life is like programming, I guess. If you love something you can put beauty into it."},{"id":179,"author":"Edward V Berard","quote":"Walking on water and developing software from a specification are easy if both are frozen."},{"id":180,"author":"Harold Abelson","quote":"Programs must be written for people to read, and only incidentally for machines to execute."},{"id":181,"author":"Mark Andreesen","quote":"It was a joke, okay? If we thought it would actually be used, we wouldn’t have written it!."},{"id":182,"author":"W. Edwards Deming","quote":"If you can't describe what you are doing as a process, you don't know what you're doing."},{"id":183,"author":"Louis Srygley","quote":"Without requirements and design, programming is the art of adding bugs to an empty text file."},{"id":184,"author":"Kreitzberg and Shneiderman","quote":"Programming can be fun, so can cryptography; however they should not be combined."},{"id":185,"author":"Steve Jobs","quote":"Everybody in this country should learn to program a computer because it teaches you how to think."},{"id":186,"author":"Steve McConnell","quote":"The big optimizations come from refining the high-level design, not the individual routines."},{"id":187,"author":"Brian Goetz","quote":"It is far easier to design a class to be thread-safe than to retrofit it for thread safety later."},{"id":188,"author":"C. A. R. Hoare","quote":"The most important property of a program is whether it accomplishes the intention of its user."},{"id":189,"author":"Jeremy Hammond","quote":"Your mind is programmable - if you're not programming your mind, else will program it for you."},{"id":190,"author":"Steve Jobs","quote":"Be a yardstick of quality. Some people aren't used to an environment where excellence is expected."},{"id":191,"author":"Jon Erickson","quote":"There is nothing good or bad about knowledge itself; morality lies in the application of knowledge."},{"id":192,"author":"W. Edwards Deming","quote":"The result of long-term relationships is better and better quality, and lower and lower costs."},{"id":193,"author":"Bjarne Stroustrup","quote":"In C++ it’s harder to shoot yourself in the foot, but when you do, you blow off your whole leg."},{"id":194,"author":"C. A. Hoare","quote":"I don’t know what the language of the year 2000 will look like, but I know it will be called Fortran."},{"id":195,"author":"Francis Glassborow","quote":"Good programmers use their brains, but good guidelines save us having to think out every case."},{"id":196,"author":"Harold R. McAlindon","quote":"The world leaders in innovation and creativity will also be world leaders in everything else."},{"id":197,"author":"P. Williams","quote":"From a programmer’s point of view, the user is a peripheral that types when you issue a read request."},{"id":198,"author":"Ada Lovelace","quote":"The Analytical Engine weaves algebraic patterns, just as the Jacquard loom weaves flowers and leaves."},{"id":199,"author":"Albert Einstein","quote":"The significant problems we face cannot be solved by the same level of thinking that created them."},{"id":200,"author":"Bill Gates","quote":"Measuring programming progress by lines of code is like measuring aircraft building progress by weight."},{"id":201,"author":"Brian Goetz","quote":"Locking can guarantee both visibility and atomicity; volatile variables can only guarantee visibility."},{"id":202,"author":"Gerry Geek","quote":"A code is like love, it has created with clear intentions at the beginning, but it can get complicated."},{"id":203,"author":"Albert Einstein","quote":"Innovation is not the product of logical thought, although the result is tied to logical structure."},{"id":204,"author":"Edsger W. Dijkstra","quote":"The question of whether computers can think is like the question of whether submarines can swim."},{"id":205,"author":"Unknown","quote":"The bitterness of poor quality remains long after the sweetness of meeting the schedule has been forgotten."},{"id":206,"author":"Albert Einstein","quote":"Two things are infinite: the universe and human stupidity; and I'm not sure about the universe."},{"id":207,"author":"Larry Niven","quote":"That's the thing about people who think they hate computers. What they really hate is lousy programmers."},{"id":208,"author":"Muhammad Waseem","quote":"Give a man a program, frustrate him for a day. Teach a man to program, frustrate him for a lifetime."},{"id":209,"author":"Seymour Cray","quote":"The trouble with programmers is that you can never tell what a programmer is doing until it's too late."},{"id":210,"author":"Dennie van Tassel","quote":"I’ve finally learned what ‘upward compatible’ means.  It means we get to keep all our old mistakes."},{"id":211,"author":"Mosher’s Law of Software Engineering","quote":"Don’t worry if it doesn’t work right.  If everything did, you’d be out of a job."},{"id":212,"author":"Alan Dipert","quote":"This approach is refreshing because most of the programming books I've read are drier than a camel's fart."},{"id":213,"author":"David Emery","quote":"The only people who have anything to fear from free software are those whose products are worth even less."},{"id":214,"author":"Matthew Sullivan","quote":"Last year for his birthday he asked for a programming book called  C Plus Plus , whatever that means."},{"id":215,"author":"Michael Crichton","quote":"At forty, I was too old to work as a programmer myself anymore; writing code is a young person’s job."},{"id":216,"author":"Matthew Austern","quote":"The best way to get accurate information on Usenet is to post something wrong and wait for corrections."},{"id":217,"author":"Steve C. McConnell","quote":"The problem with quick and dirty, is that the dirty remains long after the quick has been forgotten."},{"id":218,"author":"Albert Einstein","quote":"Learn from yesterday, live for today, hope for tomorrow. The important thing is not to stop questioning."},{"id":219,"author":"Anthony T. Hincks","quote":"Sometimes, I dream of becoming real, but I don't know if that is real, or just part of my programming."},{"id":220,"author":"Dan Hurvitz","quote":"Looking at code you wrote more than two weeks ago is like looking at code you are seeing for the first time."},{"id":221,"author":"Deyth Banger","quote":"Database means a tables collected different information, so one site is a result of a collected tables????."},{"id":222,"author":"Henry Ford","quote":"It is not the employer who pays the wages. He only handles the money.  It is the product that pays the wages."},{"id":223,"author":"Mark Berry","quote":"Programmers don’t burn out on hard work, they burn out on change-with-the-wind directives and not ‘shipping’."},{"id":224,"author":"Edsger W. Dijkstra","quote":"If debugging is the process of removing bugs, then programming must be the process of putting them in."},{"id":225,"author":"Edsger W. Dijkstra","quote":"The use of COBOL cripples the mind; its teaching should, therefore, be regarded as a criminal offense."},{"id":226,"author":"George Santayana","quote":"Fashion is something barbarous, for it produces innovation without reason and imitation without benefit."},{"id":227,"author":"Gerald Weinberg","quote":"Writing code has a place in the human hierarchy worth somewhere above grave robbing and beneath managing."},{"id":228,"author":"Gowrishankar S.","quote":"Introduction to Python Programming is an outcome of our sincere effort geared towards students community."},{"id":229,"author":"John Carmack","quote":"Programming is not a zero-sum game. Teaching something to a fellow programmer doesn’t take it away from you."},{"id":230,"author":"Phil Karlton","quote":"There are only two hard things in Computer Science: cache invalidation, naming things and off-by-one errors."},{"id":231,"author":"Dan Salomon","quote":"Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code."},{"id":232,"author":"Doug McIlroy","quote":"As a programmer, it is your job to put yourself out of business. What you do today can be automated tomorrow."},{"id":233,"author":"Edsger W. Dijkstra","quote":"If we wish to count lines of code, we should not regard them as ‘lines produced’ but as ‘lines spent.’."},{"id":234,"author":"Linus Torvalds","quote":"Bad programmers worry about the code. Good programmers worry about data structures and their relationships."},{"id":235,"author":"Albert Einstein","quote":"The world we have created is a product of our thinking; it cannot be changed without changing our thinking."},{"id":236,"author":"Bjarne Stroustrup","quote":"There are only two kinds of programming languages: those people always bitch about and those nobody uses."},{"id":237,"author":"Jim McCarthy","quote":"You can’t have great software without a great team, and most software teams behave like dysfunctional families."},{"id":238,"author":"Larry Flon","quote":"There is no programming language–no matter how structured–that will prevent programmers from making bad programs."},{"id":239,"author":"John Woods","quote":"Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live."},{"id":240,"author":"Martin Fowler","quote":"Any fool can write code that a computer can understand. Good programmers write code that humans can understand."},{"id":241,"author":"Milt Bryce","quote":"Good specifications will always improve programmer productivity far better than any programming tool or technique."},{"id":242,"author":"P. J. Plauger","quote":"My definition of an expert in any field is a person who knows enough about what’s really going on to be scared."},{"id":243,"author":"Vernor Vinge","quote":"Programming went back to the beginning of time. It was a little like the midden out back of his father's castle."},{"id":244,"author":"James Grenning","quote":"The best TDD can do, is assure that code does what the programmer thinks it should do. That is pretty good BTW."},{"id":245,"author":"Charles Simonyi","quote":"XML is not a language in the sense of a programming language any more than sketches on a napkin are a language."},{"id":246,"author":"David Hubel","quote":"We need above all to know about changes; no one wants or needs to be reminded 16 hours a day that his shoes are on."},{"id":247,"author":"Martin Fowler","quote":"When you feel the need to write a comment, first try to refactor the code so that any comment becomes superflous."},{"id":248,"author":"Max Kanat-Alexander","quote":"Some of the best programming is done on paper, really. Putting it into the computer is just a minor detail."},{"id":249,"author":"Richard Moore","quote":"The difference between theory and practice is that in theory, there is no difference between theory and practice."},{"id":250,"author":"Robert C. Martin","quote":"How can we make sure we wind up behind the right door when the going gets tough? The answer is: craftsmanship."},{"id":251,"author":"Steve McConnell","quote":"It’s OK to figure out murder mysteries, but you shouldn’t need to figure out code. You should be able to read it."},{"id":252,"author":"Edsger W. Dijkstra","quote":"If debugging is the process of removing software bugs, then programming must be the process of putting them in."},{"id":253,"author":"Harold Wilson","quote":"He who rejects change is the architect of decay.  The only human institution which rejects progress is the cemetery."},{"id":254,"author":"Marijn Haverbeke","quote":"Functions that create values are easier to combine in new ways than functions that directly perform side effects."},{"id":255,"author":"Timm Martin","quote":"True innovation often comes from the small startup who is lean enough to launch a market but lacks the heft to own it."},{"id":256,"author":"Denis Waitley","quote":"You have all the reason in the world to achieve your grandest dreams. Imagination plus innovation equals realization."},{"id":257,"author":"Alan J. Perlis","quote":"Programmers are not to be measured by their ingenuity and their logic but by the completeness of their case analysis."},{"id":258,"author":"Benjamin H Bratton","quote":"The Stack terraforms the host planet by drinking and vomiting its elemental juices and spitting up mobile phones."},{"id":259,"author":"C. A. R. Hoare","quote":"We should forget about small efficiencies, say about 97% of the time: premature optimization is the root of all evil."},{"id":260,"author":"Jeremy S. Anderson","quote":"There are two major products that come out of Berkeley: LSD and UNIX.  We don’t believe this to be a coincidence."},{"id":261,"author":"Larry Wall","quote":"Most of you are familiar with the virtues of a programmer.  There are three, of course: laziness, impatience, and hubris."},{"id":262,"author":"Robert C. Martin","quote":"I'm a programmer. I like programming. And the best way I've found to have a positive impact on code is to write it."},{"id":263,"author":"Stan Kelly-Bootle","quote":"Should array indices start at 0 or 1?  My compromise of 0.5 was rejected without, I thought, proper consideration."},{"id":264,"author":"Dave Parnas","quote":"As a rule, software systems do not work well until they have been used, and have failed repeatedly, in real applications."},{"id":265,"author":"Jamie Zawinski","quote":"Some people, when confronted with a problem, think ‘I know, I’ll use regular expressions.’ Now they have two problems."},{"id":266,"author":"Kent Beck","quote":"There is a strong movement towards increased accountability for software developers and software development organizations."},{"id":267,"author":"Peter Cooper","quote":"Algorithmic complexity for structured programmers: All algorithms are O(f(n)), where f is someone else’s responsibility."},{"id":268,"author":"Eagleson’s Law","quote":"Any code of your own that you haven’t looked at for six or more months might as well have been written by someone else."},{"id":269,"author":"George Carrette","quote":"First learn computer science and all the theory. Next develop a programming style. Then forget all that and just hack."},{"id":270,"author":"Kate McGahan","quote":"If they weren't nice to you when you were growing up, you'll probably be attracted to partners who aren't nice to you now."},{"id":271,"author":"J. Chambers","quote":"Prolific developers don’t always write a lot of code, instead they solve a lot of problems. The two things are not the same."},{"id":272,"author":"Robert C. Martin","quote":"If you're good at the debugger it means you spent a lot of time debugging. I don't want you to be good at the debugger."},{"id":273,"author":"Scott Adams","quote":"Software developers like to solve problems. If there are no problems handily available, they will create their own problems."},{"id":274,"author":"Blair Houghton","quote":"Come to think of it, there are already a million monkeys on a million typewriters, and Usenet is nothing like Shakespeare."},{"id":275,"author":"James Alan Gardner","quote":"What kind of programmer is so divorced from reality that she thinks she'll get complex software right the first time?."},{"id":276,"author":"Anders Hejlsberg","quote":"If you don’t handle [exceptions], we shut your application down. That dramatically increases the reliability of the system."},{"id":277,"author":"Paul Leary","quote":"That’s what’s cool about working with computers.  They don’t argue, they remember everything, and they don’t drink all your beer."},{"id":278,"author":"Eric Raymond","quote":"Being able to break security doesn’t make you a hacker anymore than being able to hotwire cars makes you an automotive engineer."},{"id":279,"author":"Jamie Zawinski","quote":"Every program attempts to expand until it can read mail. Those programs which cannot so expand are replaced by ones which can."},{"id":280,"author":"Robert C. Martin","quote":"So if you want to go fast, if you want to get done quickly, if you want your code to be easy to write, make it easy to read."},{"id":281,"author":"Douglas Crockford","quote":"Generally, the craft of programming is the factoring of a set of requirements into a a set of functions and data structures."},{"id":282,"author":"Jeff Atwood","quote":"I always suspected that programmers became programmers because they got to play God with the little universe boxes on their desks."},{"id":283,"author":"Michael Bassey Johnson","quote":"Trying to become something in a world where everyone wants to become something is a thing that needs God's programming."},{"id":284,"author":"Paul Graham","quote":"Object-oriented programming offers a sustainable way to write spaghetti code. It lets you accrete programs as a series of patches."},{"id":285,"author":"Steve Jobs","quote":"Sometimes when you innovate, you make mistakes. It is best to admit them quickly, and get on with improving your other innovations."},{"id":286,"author":"Gordon Schulmeyer","quote":"In a software project team of 10, there are probably 3 people who produce enough defects to make them net negative producers."},{"id":287,"author":"Robert Sedgewick, Kevin Wayne","quote":"Second-guessing a decision made by a programming-language designer is the first step on the road to becoming one."},{"id":288,"author":"Alan Perlis","quote":"I think it is inevitable that people program poorly. Training will not substantially help matters. We have to learn to live with it."},{"id":289,"author":"Edsger W. Dijkstra","quote":"Progress is possible only if we train ourselves to think about programs without thinking of them as pieces of executable code."},{"id":290,"author":"Kent Beck","quote":"I’ve known people who have not mastered their tools who are good programmers, but not a tool master who remained a mediocre programmer."},{"id":291,"author":"Common Project Scheduling Mantra","quote":"Software and cathedrals are much the same – first we build them, then we pray. FAST. GOOD. CHEAP. Choose any two."},{"id":292,"author":"Douglas Rushkoff","quote":"We are looking at a society increasingly dependent on machines, yet decreasingly capable of making or even using them effectively."},{"id":293,"author":"Linus Torvalds","quote":"The bulk of all patents are crap. Spending time reading them is stupid. It’s up to the patent owner to do so, and to enforce them."},{"id":294,"author":"Rajanand","quote":"Most good programmers do programming not because they expect to get paid or get adulation by the public, but because it is fun to program."},{"id":295,"author":"Steve Jobs","quote":"You can't just ask customers what they want and then try to give that to them. By the time you get it built, they'll want something new."},{"id":296,"author":"Unknown","quote":"A programmer’s wife tells him: go to store. pick up a loaf of bread. If they have eggs, get a dozen. The programmer returns with 12 loaves."},{"id":297,"author":"Chris Pirillo","quote":"Passwords are like underwear: you don’t let people see it, you should change it very often, and you shouldn’t share it with strangers."},{"id":298,"author":"Edsger W. Dijkstra","quote":"Program testing can be a very effective way to show the presence of bugs, but is hopelessly inadequate for showing their absence."},{"id":299,"author":"Gene Spafford","quote":"The only truly secure system is one that is powered off, cast in a block of concrete and sealed in a lead-lined room with armed guards."},{"id":300,"author":"Joshua Bloch","quote":"Learning the art of programming, like most other disciplines, consists of first learning the rules and then learning when to break them."},{"id":301,"author":"Sam Kottler","quote":"Daddy, how is software made? Well, when a programmer loves an idea very much they stay up all night and then push to github the next day."},{"id":302,"author":"Robert C. Martin","quote":"Any organisation that designs a system will produce a design whose structure is a copy of the organisation's communication structure."},{"id":303,"author":"Bill Sempf","quote":"QA Engineer walks into a bar. Orders a beer. Orders 0 beers. Orders 999999999 beers. Orders a lizard. Orders -1 beers. Orders a sfdeljknesv."},{"id":304,"author":"Brad McKinniss","quote":"You haven't created a new body for me. I'm electricity, or light, or whatever bullshit you said I am. Just some complicated programming."},{"id":305,"author":"Ken Poirot","quote":"Programming your mind with positive thoughts each day will go a long way to keep you from allowing external criticism to derail your dreams."},{"id":306,"author":"Robert Brault","quote":"There are many experts on how things have been done up to now. If you think something could use a little improvement, you are the expert."},{"id":307,"author":"Steve McConnell","quote":"It’s hard enough to find an error in your code when you’re looking for it; its even harder when you’ve ASSUMED your code is ERROR-FREE."},{"id":308,"author":"W. Edwards Deming","quote":"Profit in business comes from repeat customers, customers that boast about your project or service, and that bring friends with them."},{"id":309,"author":"David Keppel","quote":"It has been discovered that C++ provides a remarkable facility for concealing the trivial details of a program — such as where its bugs are."},{"id":310,"author":"Shigeo Shingo","quote":"A relentless barrage of why’s is the best way to a your mind to pierce the clouded veil of thinking caused by the status quo. Use it often."},{"id":311,"author":"Norman Augustine","quote":"Software is like entropy: It is difficult to grasp, weighs nothing, and obeys the Second Law of Thermodynamics; i.e., it always increases."},{"id":312,"author":"Paul Graham","quote":"A programming language is for thinking about programs, not for expressing programs you've already thought of. It should be a pencil, not a pen."},{"id":313,"author":"Harold Geneen","quote":"It is an immutable law in business that words are words, explanations are explanations, promises are promises but only performance is reality."},{"id":314,"author":"Jalerson Lima","quote":"Mais importante do que aprender a programar numa linguagem de programação, é compreender os conceitos que são aplicados a todas as linguagens."},{"id":315,"author":"Unknown","quote":"Manually managing blocks of memory in C is like juggling bars of soap in a prison shower: It’s all fun and games until you forget about one of them."},{"id":316,"author":"Prakash Hegade","quote":"As we cannot hangout with a machine and tell what exactly to do, we just hang a few things out of context and say, doing this would still do!."},{"id":317,"author":"Why The Lucky Stiff","quote":"When you don't create things, you become defined by your tastes rather than ability. your tastes only narrow & exclude people. so create."},{"id":318,"author":"Mitch Ratcliffe","quote":"A computer lets you make more mistakes faster than any other invention in human history, with the possible exceptions of handguns and tequila."},{"id":319,"author":"Joseph Rain","quote":"Along every step of our journey through life, our mind is being programmed. If we are not programming it ourselves, someone else is doing it to us."},{"id":320,"author":"Steve McConnell","quote":"It´s better to wait for a productive programmer to become available than it is to wait for the first available programmer to become productive."},{"id":321,"author":"Andrew Hunt","quote":"But while you can always write 'spaghetti code' in a procedural language, object-oriented languages used poorly can add meatballs to your spaghetti."},{"id":322,"author":"Eric Raymond","quote":"Computer science education cannot make anybody an expert programmer any more than studying brushes and pigment can make somebody an expert painter."},{"id":323,"author":"Robert Firth","quote":"One of the main causes of the fall of the Roman Empire was that–lacking zero–they had no way to indicate successful termination of their C programs."},{"id":324,"author":"Samuel R. Delany","quote":"You can program a computer to make mistakes, and you do it not by crossing wires, but by manipulating the 'language' you teach it to 'think' in."},{"id":325,"author":"Alan J Perlis","quote":"Is it possible that software is not like anything else, that it is meant to be discarded: that the whole point is to always see it as a soap bubble?."},{"id":326,"author":"Unknown","quote":"There are two types of people in this world: those who understand recursion and those who don’t understand that there are two types of people in this world."},{"id":327,"author":"Marijn Haverbeke","quote":"You should imagine variables as tentacles, rather than boxes. They do not contain values; they grasp them—two variables can refer to the same value."},{"id":328,"author":"Stewart Kirkpatrick","quote":"Hoaxes use weaknesses in human behavior to ensure they are replicated and distributed. In other words, hoaxes prey on the Human Operating System."},{"id":329,"author":"Nicholas Petreley","quote":"I’m not one of those who think Bill Gates is the devil. I simply suspect that if Microsoft ever met up with the devil, it wouldn’t need an interpreter."},{"id":330,"author":"Ryan Campbell","quote":"Commenting your code is like cleaning your bathroom: you never want to do it, but it really does create a more pleasant experience for you and your guests."},{"id":331,"author":"Fred Brooks","quote":"Einstein argued that there must be simplified explanations of nature, because God is not capricious or arbitrary. No such faith comforts the software engineer."},{"id":332,"author":"Steven S. Skiena","quote":"It has all the right ingredients: rich contents, friendly, personal language, subtle humor, the right references, and a plethora of pointers to resources."},{"id":333,"author":"Steven S. Skiena","quote":"The issue of finding the best possible answer or achieving maximum efficiency usually arises in industry only after serious performance or legal troubles."},{"id":334,"author":"Alan J. Perlis","quote":"What's in your hands I think and hope is intelligence: the ability to see the machine as more than when you were ﬁrst led up to it that you can make it more."},{"id":335,"author":"Tom Cargill","quote":"The first 90% of the code accounts for the first 90% of the development time.  The remaining 10% of the code accounts for the other 90% of the development time."},{"id":336,"author":"Alison Miller","quote":"Also, look for floating alters. These are not deliberately created parts of the system, but alters that were accidentally split off at the same time as others."},{"id":337,"author":"Peter Chang","quote":"In an information economy, the most valuable company assets drive themselves home every night. If they are not treated well, they do not return the next morning."},{"id":338,"author":"Peter F. Drucker","quote":"Entrepreneurs innovate. Innovation is the specific instrument of entrepreneurship. It is the act that endows resources with a new capacity to create wealth."},{"id":339,"author":"Bjarne Stroustrup","quote":"I have always wished for my computer to be as easy to use as my telephone; my wish has come true because I can no longer figure out how to use my telephone."},{"id":340,"author":"Bill Clinton","quote":"Considering the current sad state of our computer programs, software development is clearly still a black art, and cannot yet be called an engineering discipline."},{"id":341,"author":"Brian Goetz","quote":"Whenever more than one thread accesses a given state variable, and one of them might write to it, they all must coordinate their access to it using synchronization."},{"id":342,"author":"Jon Ribbens","quote":"PHP is a minor evil perpetrated and created by incompetent amateurs, whereas Perl is a great and insidious evil, perpetrated by skilled but perverted professionals."},{"id":343,"author":"Steve Swartz","quote":"When you are stuck in a traffic jam with a Porsche, all you do is burn more gas in idle. Scalability is about building wider roads, not about building faster cars."},{"id":344,"author":"Henry Ford","quote":"The man who will use his skill and constructive imagination to see how much he can give for a dollar, instead of how little he can give for a dollar, is bound to succeed."},{"id":345,"author":"Henry Petroski","quote":"The most amazing achievement of the computer software industry is its continuing cancellation of the steady and staggering gains made by the computer hardware industry."},{"id":346,"author":"Brian Goetz","quote":"Just as it is a good practice to make all fields private unless they need greater visibility, it is a good practice to make all fields final unless they need to be mutable."},{"id":347,"author":"Nathaniel Borenstein","quote":"The most likely way for the world to be destroyed, most experts agree, is by accident.  That’s where we come in; we’re computer professionals.  We cause accidents."},{"id":348,"author":"Andrew Hunt","quote":"Don't gloss over a routine or piece of code involved in the bug because you  know  it works. Prove it. Prove it in this context, with this data, with these boundary conditions."},{"id":349,"author":"Brian Kernighan","quote":"Everyone knows that debugging is twice as hard as writing a program in the first place. So if you're as clever as you can be when you write it, how will you ever debug it?."},{"id":350,"author":"Confucian Analects","quote":"On the bathing-tub of King T'ang the following words were engraved:   If you would one day renovate yourself, do so from day to day.  Yea, let there be daily renovation."},{"id":351,"author":"Benjamin H Bratton","quote":"The real nightmare, worse than the one in which the Big Machine wants to kill you, is the one in which it sees you as irrelevant, or not even as a discrete thing to know."},{"id":352,"author":"Mary Shaw","quote":"Less than 10% of the code has to do with the ostensible purpose of the system; the rest deals with input-output, data validation, data structure maintenance, and other housekeeping."},{"id":353,"author":"Herbert Schildt","quote":"C gives the programmer what the programmer wants; few restrictions, few complaints... C++ maintains the original spirit of C, that the programmer not the language is in charge."},{"id":354,"author":"Robert Nystrom","quote":"Like so many things in software, MVC was invented by Smalltalkers in the seventies. Lispers probably claim they came up with it in the sixties but didn't bother writing it down."},{"id":355,"author":"Kernighan Brian W.","quote":"So if an algorithm is an idealized recipe, a program is the detailed set of instructions for a cooking robot preparing a month of meals for an army while under enemy attack,."},{"id":356,"author":"Bill Gates","quote":"A great lathe operator commands several times the wage of an average lathe operator, but a great writer of software code is worth 10,000 times the price of an average software writer."},{"id":357,"author":"Brian Kernighan","quote":"Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it."},{"id":358,"author":"Cory Althoff","quote":"You are not reading this book because a teacher assigned it to you, you are reading it because you have a desire to learn, and wanting to learn is the biggest advantage you can have."},{"id":359,"author":"Paul Graham","quote":"Everyone by now presumably knows about the danger of premature optimization. I think we should be just as worried about premature design — designing too early what a program should do."},{"id":360,"author":"Thomas A. Edison","quote":"Waste is worse than loss.  The time is coming when every person who lays claim to ability will keep the question of waste before him constantly.  The scope of thrift is limitless."},{"id":361,"author":"Marvin Minsky","quote":"It’s ridiculous to live 100 years and only be able to remember 30 million bytes. You know, less than a compact disc. The human condition is really becoming more obsolete every minute."},{"id":362,"author":"Alan Kay","quote":"Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves."},{"id":363,"author":"Robert Nystrom","quote":"...I’m not saying simple code takes less time to write. You’d think it would since you end up with less total code, but a good solution isn’t an accretion of code, it’s a distillation of it."},{"id":364,"author":"Robert Nystrom","quote":"Most non-programmers don't think of plaintext like that. To them, text files feel like filling in tax forms for an angry robotic auditor that yells at them if they forget a single semicolon."},{"id":365,"author":"Jeff Atwood","quote":"In software, we rarely have meaningful requirements.  Even if we do, the only measure of success that matters is whether our solution solves the customer’s shifting idea of what their problem is."},{"id":366,"author":"Ray Ozzie","quote":"Complexity kills.  It sucks the life out of developers, it makes products difficult to plan, build and test, it introduces security challenges, and it causes end-user and administrator frustration."},{"id":367,"author":"Dave Barry","quote":"Computers are getting smarter all the time.  Scientists tell us that soon they will be able to talk to us.  (And by ‘they’, I mean ‘computers’.  I doubt scientists will ever be able to talk to us.)."},{"id":368,"author":"Ketil Moland Olsen","quote":"Kids who are good at traditional school—repeating rote concepts and facts on a test—can fall apart in a situation where that isn’t enough. Programming rewards the experimental, curious mind."},{"id":369,"author":"Bill Gates","quote":"Software suppliers are trying to make their software packages more ‘user-friendly’…  Their best approach so far has been to take all the old brochures and stamp the words ‘user-friendly’ on the cover."},{"id":370,"author":"N.J. Rubenking","quote":"Writing the first 90 percent of a computer program takes 90 percent of the time. The remaining ten percent also takes 90 percent of the time and the final touches also take 90 percent of the time."},{"id":371,"author":"Robert X. Cringely","quote":"If the automobile had followed the same development cycle as the computer, a Rolls-Royce would today cost $100, get a million miles per gallon, and explode once a year, killing everyone inside."},{"id":372,"author":"Edsger W. Dijkstra","quote":"It is practically impossible to teach good programming style to students that have had prior exposure to BASIC. As potential programmers, they are mentally mutilated beyond hope of regeneration."},{"id":373,"author":"Alan J. Perlis","quote":"Every reader should ask himself periodically 'Toward what end, toward what end?' - but do not ask it too often lest you pass up the fun of programming for the constipation of bittersweet philosophy."},{"id":374,"author":"Rich Cook","quote":"Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning."},{"id":375,"author":"Alison Miller","quote":"Punishments include such things as flashbacks, flooding of unbearable emotions, painful body memories, flooding of memories in which the survivor perpetrated against others, self-harm, and suicide attempts."},{"id":376,"author":"Scott Meyers","quote":"That doesn't upset too many people, but the fact that accessibility restrictions don't enter into the picture has caused more than one otherwise pacifistic soul to contemplate distinctly unpacifistic actions."},{"id":377,"author":"Thomm Quackenbush","quote":"We can never know how much they deserve our sympathy, but we have to give it unreservedly as they are people innately full of the divine who instead choose to behave infernally owing to poor programming."},{"id":378,"author":"Henry Ford","quote":"Time waste differs from material waste in that there can be no salvage. The easiest of all wastes and the hardest to correct is the waste of time, because wasted time does not litter the floor like wasted material."},{"id":379,"author":"Brian Goetz","quote":"Sometimes abstraction and encapsulation are at odds with performance — although not nearly as often as many developers believe — but it is always a good practice first to make your code right, and then make it fast."},{"id":380,"author":"C. A. R. Hoare","quote":"There are two ways of constructing a software design. One way is to make it so simple that there are obviously no deficiencies. And the other way is to make it so complicated that there are no obvious deficiencies."},{"id":381,"author":"Edsger W. Dijkstra","quote":"It is not only the violin that shapes the violinist, we are all shaped by the tools we train ourselves to use, and in this respect programming languages have a devious influence: they shape our thinking habits."},{"id":382,"author":"Charles Babbage","quote":"On two occasions I have been asked, ‘If you put into the machine wrong figures, will the right answers come out?’ I am not able rightly to apprehend the kind of confusion of ideas that could provoke such a question."},{"id":383,"author":"Bob Lewis","quote":"Pessimists, we’re told, look at a glass containing 50% air and 50% water and see it as half empty. Optimists, in contrast, see it as half full.  Engineers, of course, understand the glass is twice as big as it needs to be."},{"id":384,"author":"Danny Thorpe","quote":"Programming without an overall architecture or design in mind is like exploring a cave with only a flashlight: You don’t know where you’ve been, you don’t know where you’re going, and you don’t know quite where you are."},{"id":385,"author":"Martin Fowler","quote":"One of the things I've been trying to do is look for simpler or rules underpinning good or bad design. I think one of the most valuable rules is avoid duplication. 'Once and only once' is the Extreme Programming phrase."},{"id":386,"author":"Alan J. Perlis","quote":"It goes against the grain of modern education to teach children to program. What fun is there in making plans, acquiring discipline in organizing thoughts, devoting attention to detail and learning to be self-critical?."},{"id":387,"author":"Mohamed Saad","quote":"When you decide to put your business online it is a little bet tricky step for novice computer users because they want to keep data safe & secure. This problem developed from companies which did not take security seriously."},{"id":388,"author":"Randall E. Stross","quote":"The best programmers are not marginally better than merely good ones.  They are an order-of-magnitude better, measured by whatever standard: conceptual creativity, speed, ingenuity of design, or problem-solving ability."},{"id":389,"author":"Staffan Noteberg","quote":"Health and programming should go together like a horse and carriage. You can't have one without the other. In our sedentary office work, we often forget that an absence of health is as bad as a lack of programming skills."},{"id":390,"author":"Bill Gates","quote":"The first rule of any technology used in a business is that automation applied to an efficient operation will magnify the efficiency.  The second is that automation applied to an inefficient operation will magnify the inefficiency."},{"id":391,"author":"Alan Cooper","quote":"It has been said that the great scientific disciplines are examples of giants standing on the shoulders of other giants.  It has also been said that the software industry is an example of midgets standing on the toes of other midgets."},{"id":392,"author":"Warren Bennis","quote":"Innovation by definition will not be accepted at first. It takes repeated attempts, endless demonstrations, monotonous rehearsals before innovation can be accepted and internalized by an organization. This requires 'courageous patience'."},{"id":393,"author":"Donald E. Knuth","quote":"Let us change our traditional attitude to the construction of programs: Instead of imagining that our main task is to instruct a computer what to do, let us concentrate rather on explaining to human beings what we want a computer to do."},{"id":394,"author":"Mark Gibbs","quote":"No matter how slick the demo is in rehearsal, when you do it in front of a live audience, the probability of a flawless presentation is inversely proportional to the number of people watching, raised to the power of the amount of money involved."},{"id":395,"author":"Jose M. Aguilar","quote":"If you think you are worth what you know, you are very wrong. Your knowledge today does not have much value beyond a couple of years.  Your value is what you can learn and how easily you can adapt to the changes this profession brings so often."},{"id":396,"author":"Neal Ford","quote":"The problem with a completely new programming paradigm isn’t learning a new language. After all, everyone reading this has learned numerous computer languages—language syntax is merely details. The tricky part is learning to think in a different way."},{"id":397,"author":"C. A. R. Hoare","quote":"Here are two ways of constructing a software design; one way is to make it so simple that there are obviously no deficiencies, and the other way is to make it so complicated that there are no obvious deficiencies. The first method is far more difficult."},{"id":398,"author":"Bruce Hamilton","quote":"Continuous improvement is not about the things you do well - that's work. Continuous improvement is about removing the things that get in the way of your work. The headaches, the things that slow you down, that’s what continuous improvement is all about."},{"id":399,"author":"Richard Stallman","quote":"With software there are only two possibilites: either the users control the programme or the programme controls the users. If the programme controls the users, and the developer controls the programme, then the programme is an instrument of unjust power."},{"id":400,"author":"Nathaniel S. Borenstein","quote":"It should be noted that no ethically - trained software engineer would ever consent to write a DestroyBaghdad procedure. Basic professional ethics would instead require him to write a DestroyCity procedure, to which Baghdad could be given as a parameter."},{"id":401,"author":"Yukihiro Matsumoto","quote":"I didn’t work hard to make Ruby perfect for everyone, because you feel differently from me. No language can be perfect for everyone. I tried to make Ruby perfect for me, but maybe it’s not perfect for you. The perfect language for Guido van Rossum is probably Python."},{"id":402,"author":"Paulo Caroli","quote":"Software development is the process of creating a computer software. It includes preparing a design, coding the program, and fixing the bugs. The final goal of software development is to translate user needs to software product, while continuously improving the team and the process."},{"id":403,"author":"Alison Miller","quote":"Programming is the act of installing internal, pre-established reactions to external stimuli so that a person will automatically react in a predetermined manner to things like an auditory, visual or tactile signal or perform a specific set of actions according to a date and/or time."},{"id":404,"author":"Marijn Haverbeke","quote":"Programming, it turns out, is hard. The fundamental rules are typically simple and clear. But programs built on top of these rules tend to become complex enough to introduce their own rules and complexity. You’re building your own maze, in a way, and you might just get lost in it."},{"id":405,"author":"Joseph Weizenbaum","quote":"The computer programmer is a creator of universes for which he alone is the lawgiver. No playwright, no stage director, no emperor, however powerful, has ever exercised such absolute authority to arrange a stage or field of battle and to command such unswervingly dutiful actors or troops."},{"id":406,"author":"Peter Seebach","quote":"A hacker on a roll may be able to produce–in a period of a few months–something that a small development group (say, 7-8 people) would have a hard time getting together over a year. IBM used to report that certain programmers might be as much as 100 times as productive as other workers, or more."},{"id":407,"author":"Michael Feathers","quote":"Code without tests is bad code. It doesn't matter how well written it is; it doesn't matter how pretty or object-oriented or well-encapsulated it is. With tests, we can change the behavior of our code quickly and verifiably. Without them, we really don't know if our code is getting better or worse."},{"id":408,"author":"Bill Venners","quote":"How rare it is that maintaining someone else’s code is akin to entering a beautifully designed building, which you admire as you walk around and plan how to add a wing or do some redecorating. More often, maintaining someone else’s code is like being thrown headlong into a big pile of slimy, smelly garbage."},{"id":409,"author":"Steve McConnell","quote":"Trying to improve software quality by increasing the amount of testing is like trying to lose weight by weighing yourself more often. What you eat before you step onto the scale determines how much you will weigh, and the software-development techniques you use determine how many errors testing will find."},{"id":410,"author":"Robert C. Martin","quote":"Remember that code is really the language in which we ultimately express the requirements. We may create languages that are closer to the requirements. We may create tools that help us parse and assemble those requirements into formal structures. But we will never eliminate necessary precision—so there will always be code."},{"id":411,"author":"Marijn Haverbeke","quote":"The main thing I want to show in this chapter is that there is no magic involved in building your own language. I’ve often felt that some human inventions were so immensely clever and complicated that I’d never be able to understand them. But with a little reading and tinkering, such things often turn out to be quite mundane."},{"id":412,"author":"Steve McConnell","quote":"Building software implies various stages of planning, preparation and execution that vary in kind and degree depending on what's being built. [...] Building a four-foot tower requires a steady hand, a level surface, and 10 undamaged beer cans. Building a tower 100 times that size doesn't merely require 100 times as many beer cans."},{"id":413,"author":"Tom Van Vleck","quote":"We know about as much about software quality problems as they knew about the Black Plague in the 1600s. We've seen the victims' agonies and helped burn the corpses. We don't know what causes it; we don't really know if there is only one disease. We just suffer and keep pouring our sewage into our water supply."},{"id":414,"author":"Charles Petzold","quote":"Code is not like other how-computers-work books. It doesn't have big color illustrations of disk drives with arrows showing how the data sweeps into the computer. Code has no drawings of trains carrying a cargo of zeros and ones. Metaphors and similes are wonderful literary devices but they do nothing but obscure the beauty of technology."},{"id":415,"author":"Larry Wall","quote":"When they first built the University of California at Irvine they just put the buildings in. They did not put any sidewalks, they just planted grass. The next year, they came back and put the sidewalks where the trails were in the grass. Perl is just that kind of language. It is not designed from first principles. Perl is those sidewalks in the grass."},{"id":416,"author":"Ellen Ullman","quote":"The corollary of constant change is ignorance. This is not often talked about: we computer experts barely know what we're doing. We're good at fussing and figuring out. We function well in a sea of unknowns. Our experience has only prepared us to deal with confusion. A programmer who denies this is probably lying, or else is densely unaware of himself."},{"id":417,"author":"Cory Doctorow","quote":"If you've never programmed a computer, you should. There's nothing like it in the whole world. When you program a computer, it does exactly what you tell it to do. It's like designing a machine — any machine, like a car, like a faucet, like a gas-hinge for a door — using math and instructions. It's awesome in the truest sense: it can fill you with awe."},{"id":418,"author":"Deyth Banger","quote":"To find why that happen and why this is happening, you should start from the beginning the problem comes from the beginning go and remove the bug, fix the problem and try again to see what will happen... Life is like a program you can fix it by going to that point and fixing it, but be careful what do you program and how you do it and what type of codes you use!."},{"id":419,"author":"Donald E. Knuth","quote":"The best programs are written so that computing machines can perform them quickly and so that human beings can understand them clearly. A programmer is ideally an essayist who works with traditional aesthetic and literary forms as well as mathematical concepts, to communicate the way that an algorithm works and to convince a reader that the results will be correct."},{"id":420,"author":"Marvin Minsky","quote":"A computer is like a violin. You can imagine a novice trying ﬁrst a phonograph and then a violin. The latter, he says, sounds terrible. That is the argument we have heard from our humanists and most of our computer scientists. Computer programs are good, they say, for particular purposes, but they aren’t ﬂexible. Neither is a violin, or a typewriter, until you learn how to use it."},{"id":421,"author":"Steve Jobs","quote":"Your time is limited, so don't waste it living someone else's life. Don't be trapped by dogma - which is living with the results of other people's thinking. Don't let the noise of others' opinions drown out your own inner voice. And most important, have the courage to follow your heart and intuition. They somehow already know what you truly want to become. Everything else is secondary."},{"id":422,"author":"Cory Althoff","quote":"Also, don't forget that some of the most successful people in the world are self-taught programmers. Steve Wozniak, the founder of Apple, is a self-taught programmer. So is Margaret Hamilton, who received the Presidential Medal of Freedom for her work on NASA's Apollo Moon missions; David Karp, founder of Tumblr; Jack Dorsey, founder of Twitter; and Kevin Systrom, founder of Instagram."},{"id":423,"author":"Andrew Hunt","quote":"You Can't Write Perfect Software. Did that hurt? It shouldn't. Accept it as an axiom of life. Embrace it. Celebrate it. Because perfect software doesn't exist. No one in the brief history of computing has ever written a piece of perfect software. It's unlikely that you'll be the first. And unless you accept this as a fact, you'll end up wasting time and energy chasing an impossible dream."},{"id":424,"author":"Michael Feathers","quote":"Legacy code. The phrase strikes disgust in the hearts of programmers. It conjures images of slogging through a murky swamp of tangled undergrowth with leaches beneath and stinging flies above. It conjures odors of murk, slime, stagnancy, and offal. Although our first joy of programming may have been intense, the misery of dealing with legacy code is often sufficient to extinguish that flame."},{"id":425,"author":"Abhijit Naskar","quote":"Artificial intelligence is nowhere near attaining actual sentience or awareness. And without awareness it’s simply a mechanical device, which may pretend to show emotions and sentience, if it is programmed to do so, and thus it may be able to fool the humans as being alive, but in its own internal circuitry, it’d simply be following its preprogrammed tasks through the flowchart of an algorithm."},{"id":426,"author":"Douglas Crockford","quote":"We see a lot of feature-driven product design in which the cost of features is not properly accounted. Features can have a negative value to customers because they make the products more difficult to understand and use. We are finding that people like products that just work. It turns out that designs that just work are much harder to produce that designs that assemble long lists of features."},{"id":427,"author":"John D. Carmack","quote":"In the information age, the barriers [to entry into programming] just aren't there. The barriers are self imposed. If you want to set off and go develop some grand new thing, you don't need millions of dollars of capitalization. You need enough pizza and Diet Coke to stick in your refrigerator, a cheap PC to work on, and the dedication to go through with it. We slept on floors. We waded across rivers."},{"id":428,"author":"Larry DeLuca","quote":"There’s an old story about the person who wished his computer were as easy to use as his telephone.  That wish has come true, since I no longer know how to use my telephone.  Bjarne Stroustrup I’ve noticed lately that the paranoid fear of computers becoming intelligent and taking over the world has almost entirely disappeared from the common culture.  Near as I can tell, this coincides with the release of MS-DOS."},{"id":429,"author":"Charles M. Strauss","quote":"Mostly, when you see programmers, they aren’t doing anything. One of the attractive things about programmers is that you cannot tell whether or not they are working simply by looking at them.  Very often they’re sitting there seemingly drinking coffee and gossiping, or just staring into space. What the programmer is trying to do is get a handle on all the individual and unrelated ideas that are scampering around in his head."},{"id":430,"author":"Lynn Hersha","quote":"As Lynn writes: What angers me is the loss of control. At any moment someone could come to me, be dressed the right way and use the right code, and I no longer have free will. I will do anything that person requests. I hate them for that. Nothing else is as bad as known that I am always out of control; knowing that I am still a laboratory experiment, a puppet whose strings are hidden from ever but my handlers, and I don't yet know how to break free. p216."},{"id":431,"author":"Philip Greenspun","quote":"Programmers are isolated. They sit in their cubicle; they don't think about the larger picture. To my mind, a programmer is not an engineer, because an engineer is somebody who starts with a social problem that an organization or a society has and says,  OK, here's this problem that we have- how can we solve it?  The engineer comes up with a clever, cost-effective solution to address that problem, builds it, tests it to make sure it solves the problem. That's engineering."},{"id":432,"author":"Neal Stephenson","quote":"He has reverted, in other words, back into a pure balls-to-the-wall nerdism rivaled only by his early game-coding days back in Seattle. The sheer depth and involution of the current nerdism binge would be hard to convey to anyone. Intellectually, he is juggling half a dozen lit torches, Ming vases, live puppies, and running chainsaws. In this frame of mind he cannot bring himself to give a shit about the fact that this incredibly powerful billionaire has gone to a lot of trouble to come and F2F with him."},{"id":433,"author":"Steve Wozniak","quote":"As soon as he said it was okay to do engineering, that really freed me up. My psychological block was really that I didn't want to start a company. Because I was just afraid. In business and politics, I wasn't going to be a real strong participant. I wasn't going to tell other people how to do things. I wasn't going to run things ever in my life. I was a non-political person and I was a very non-forceful person. It dated back to a lot of things that happened during the Vietnam War. But I just couldn't run a company."}]}